index.org
#+SETUPFILE: html.setup
#+TITLE: Kiran Purushothaman
#+INCLUDE: "navbar.org"

* Past Work
** [[https://www.playstation.com/en-us/games/dreadnought-ps4/][Dreadnought]]
*** Summary
PS4 port of PC free-to-play space combat game created with Unreal Engine 4
*** Responsibilities
- Lead build and tools team responsible for maintaining and optimizing continuous integration and developer workflows
- Investigation of miscellaneous stability and UI performance bugs
** [[https://7daystodie.com/][7 Days To Die]]
*** Summary
Xbox One and PS4 port of open world, sandbox game implemented in Unity
*** Responsibilities
- Lead optimization efforts for the console ports including reducing memory allocations, parallelization of terrain generation, and moving specific systems to a native plugin
- Implemented performance benchmark scenarios
- Researched native reimplementation of specific systems to avoid costs of Mono/C# runtime
** [[https://www.elderscrollsonline.com/en-us/home][The Elder Scrolls Online]]
*** Summary
Xbox One and PS4 port of the MMO set in Bethesda’s Elder Scrolls universe
*** Responsibilities
- Designed and implemented thread-safe abstractions for platform services (PSN and Xbox Live)
- Implemented account linking
- Worked with backend services team to implement client login system
- Implmentation of UI screens related to interactions with platform services
** [[https://store.playstation.com/en-us/product/UP9012-PCSE00383_00-BORDERLANDS2PSV1][Borderlands 2]]
*** Summary
PS Vita port of Gearbox’s co-op first person shooter
*** Responsibilities
- Implemented occlusion culling for the Vita platform
- ARM SIMD extension(NEON) related optimizations
- Misc. porting related bugs involving gameplay, rendering and physics
** Unreleased Android title
*** Summary
Port of iOS game developed using Unreal Engine 3
*** Responsibilities
- Social media integration(Facebook and Twitter)
- HTTP abstraction layer
- Local/push notifications
** [[http://dnd.wizards.com/products/digital-games/console/chronicles-mystara][Dungeons & Dragons: Chronicles of Mystara]]
*** Summary
Port of arcade classic to Xbox360, PS3, WiiU, and PC
*** Responsibilities
- Implemented "House Rules" system and related systems including multiplayer support
- Gameplay and emulation support
- "Vault" pipeline
