index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-10 Sun 15:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kiran Purushothaman</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kiran" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Kiran Purushothaman</h1>
<div class="NAVBAR">
<ul class="org-ul">
<li><a href="index.html">Home</a></li>
<li><a href="kiran_purushothaman.pdf">Resume</a></li>
<li><a href="about.html">About</a></li>
</ul>

</div>

<div id="outline-container-orgab8b24a" class="outline-2">
<h2 id="orgab8b24a">Past Work</h2>
<div class="outline-text-2" id="text-orgab8b24a">
</div>
<div id="outline-container-org8f3e5c9" class="outline-3">
<h3 id="org8f3e5c9"><a href="https://www.playstation.com/en-us/games/dreadnought-ps4/">Dreadnought</a></h3>
<div class="outline-text-3" id="text-org8f3e5c9">
</div>
<div id="outline-container-orgeb81e8b" class="outline-4">
<h4 id="orgeb81e8b">Summary</h4>
<div class="outline-text-4" id="text-orgeb81e8b">
<p>
PS4 port of PC free-to-play space combat game created with Unreal Engine 4
</p>
</div>
</div>
<div id="outline-container-org25672fe" class="outline-4">
<h4 id="org25672fe">Responsibilities</h4>
<div class="outline-text-4" id="text-org25672fe">
<ul class="org-ul">
<li>Lead build and tools team responsible for maintaining and optimizing continuous integration and developer workflows</li>
<li>Investigation of miscellaneous stability and UI performance bugs</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgca19430" class="outline-3">
<h3 id="orgca19430"><a href="https://7daystodie.com/">7 Days To Die</a></h3>
<div class="outline-text-3" id="text-orgca19430">
</div>
<div id="outline-container-orgfb36c98" class="outline-4">
<h4 id="orgfb36c98">Summary</h4>
<div class="outline-text-4" id="text-orgfb36c98">
<p>
Xbox One and PS4 port of open world, sandbox game implemented in Unity
</p>
</div>
</div>
<div id="outline-container-org1fec85c" class="outline-4">
<h4 id="org1fec85c">Responsibilities</h4>
<div class="outline-text-4" id="text-org1fec85c">
<ul class="org-ul">
<li>Lead optimization efforts for the console ports including reducing memory allocations, parallelization of terrain generation, and moving specific systems to a native plugin</li>
<li>Implemented performance benchmark scenarios</li>
<li>Researched native reimplementation of specific systems to avoid costs of Mono/C# runtime</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org154f005" class="outline-3">
<h3 id="org154f005"><a href="https://www.elderscrollsonline.com/en-us/home">The Elder Scrolls Online</a></h3>
<div class="outline-text-3" id="text-org154f005">
</div>
<div id="outline-container-orgea0468a" class="outline-4">
<h4 id="orgea0468a">Summary</h4>
<div class="outline-text-4" id="text-orgea0468a">
<p>
Xbox One and PS4 port of the MMO set in Bethesda’s Elder Scrolls universe
</p>
</div>
</div>
<div id="outline-container-orgbe92a8b" class="outline-4">
<h4 id="orgbe92a8b">Responsibilities</h4>
<div class="outline-text-4" id="text-orgbe92a8b">
<ul class="org-ul">
<li>Designed and implemented thread-safe abstractions for platform services (PSN and Xbox Live)</li>
<li>Implemented account linking</li>
<li>Worked with backend services team to implement client login system</li>
<li>Implmentation of UI screens related to interactions with platform services</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9a1b348" class="outline-3">
<h3 id="org9a1b348"><a href="https://store.playstation.com/en-us/product/UP9012-PCSE00383_00-BORDERLANDS2PSV1">Borderlands 2</a></h3>
<div class="outline-text-3" id="text-org9a1b348">
</div>
<div id="outline-container-org91f929f" class="outline-4">
<h4 id="org91f929f">Summary</h4>
<div class="outline-text-4" id="text-org91f929f">
<p>
PS Vita port of Gearbox’s co-op first person shooter
</p>
</div>
</div>
<div id="outline-container-orga38d076" class="outline-4">
<h4 id="orga38d076">Responsibilities</h4>
<div class="outline-text-4" id="text-orga38d076">
<ul class="org-ul">
<li>Implemented occlusion culling for the Vita platform</li>
<li>ARM SIMD extension(NEON) related optimizations</li>
<li>Misc. porting related bugs involving gameplay, rendering and physics</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc51571a" class="outline-3">
<h3 id="orgc51571a">Unreleased Android title</h3>
<div class="outline-text-3" id="text-orgc51571a">
</div>
<div id="outline-container-org6b6ebf3" class="outline-4">
<h4 id="org6b6ebf3">Summary</h4>
<div class="outline-text-4" id="text-org6b6ebf3">
<p>
Port of iOS game developed using Unreal Engine 3
</p>
</div>
</div>
<div id="outline-container-orgd292745" class="outline-4">
<h4 id="orgd292745">Responsibilities</h4>
<div class="outline-text-4" id="text-orgd292745">
<ul class="org-ul">
<li>Social media integration(Facebook and Twitter)</li>
<li>HTTP abstraction layer</li>
<li>Local/push notifications</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org63fd97b" class="outline-3">
<h3 id="org63fd97b"><a href="http://dnd.wizards.com/products/digital-games/console/chronicles-mystara">Dungeons &amp; Dragons: Chronicles of Mystara</a></h3>
<div class="outline-text-3" id="text-org63fd97b">
</div>
<div id="outline-container-org49af30e" class="outline-4">
<h4 id="org49af30e">Summary</h4>
<div class="outline-text-4" id="text-org49af30e">
<p>
Port of arcade classic to Xbox360, PS3, WiiU, and PC
</p>
</div>
</div>
<div id="outline-container-orga4083fc" class="outline-4">
<h4 id="orga4083fc">Responsibilities</h4>
<div class="outline-text-4" id="text-orga4083fc">
<ul class="org-ul">
<li>Implemented "House Rules" system and related systems including multiplayer support</li>
<li>Gameplay and emulation support</li>
<li>"Vault" pipeline</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
